Ran Plan for dir: `projects/dev` workspace: `default`

<details><summary>Show Output</summary>

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # module.argocd.data.kubernetes_secret.argocd_initial_password will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "kubernetes_secret" "argocd_initial_password" {
      + data      = (sensitive value)
      + id        = (known after apply)
      + immutable = (known after apply)
      + type      = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "argocd-initial-admin-secret"
          + namespace        = "argocd"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.cloudflare.cloudflare_dns_record.istio-gateway will be updated in-place
~ resource "cloudflare_dns_record" "istio-gateway" {
      + comment             = (known after apply)
      + comment_modified_on = (known after apply)
      ~ content             = "34.47.92.167" -> (known after apply)
      ~ created_on          = "2025-01-28T12:03:24Z" -> (known after apply)
      + data                = (known after apply)
        id                  = "5b3805bf479bd12a29aad2877a6cfdfa"
      ~ meta                = jsonencode(
            {
              - auto_added             = false
              - managed_by_apps        = false
              - managed_by_argo_tunnel = false
            }
        ) -> (known after apply)
      ~ modified_on         = "2025-01-28T12:03:24Z" -> (known after apply)
        name                = "*.goboolean.io"
      ~ proxiable           = true -> (known after apply)
      ~ settings            = {
          + flatten_cname = (known after apply)
          + ipv4_only     = (known after apply)
          + ipv6_only     = (known after apply)
        } -> (known after apply)
        tags                = []
      + tags_modified_on    = (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.istio.data.kubernetes_service.istio_ingressgateway will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "kubernetes_service" "istio_ingressgateway" {
      + id     = (known after apply)
      + spec   = (known after apply)
      + status = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "istio-ingressgateway"
          + namespace        = "istio-system"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.namespace.kubernetes_namespace.postgresql will be created
+ resource "kubernetes_namespace" "postgresql" {
      + id                               = (known after apply)
      + wait_for_default_service_account = false

      + metadata {
          + generation       = (known after apply)
          + name             = "postgresql"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.postgresql.helm_release.postgresql will be created
+ resource "helm_release" "postgresql" {
      + atomic                     = false
      + chart                      = "postgresql"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "postgresql"
      + namespace                  = "postgresql"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://charts.bitnami.com/bitnami"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 600
      + values                     = [
          + (sensitive value),
        ]
      + verify                     = false
      + version                    = "16.4.5"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # module.postgresql.kubernetes_manifest.postgresql-init-script will be created
+ resource "kubernetes_manifest" "postgresql-init-script" {
      + manifest = {
          + apiVersion = "v1"
          + data       = {
              + "schema.sql" = <<-EOT
                    CREATE TYPE platform AS ENUM ('POLYGON', 'KIS', 'BUYCYCLE');
                    CREATE TYPE market AS ENUM ('STOCK', 'CRYPTO', 'FOREX', 'OPTION', 'FUTURE');
                    CREATE TYPE locale AS ENUM ('KOR', 'USA');
                    
                    /* metadata table for product data */
                    CREATE TABLE product_meta (
                      id          varchar(32) NOT NULL,  /* an identifier form : {market}.{symbol}.{locale} */
                      symbol      varchar(16)  NOT NULL, /* product symbol */
                      platform    platform    NOT NULL, /* ex) polygon,   */
                      locale      locale      NOT NULL, /* locale of product */
                      market      market      NOT NULL, /* market of product */
                    
                      name        varchar(32), /* human readable stock name, optional */
                      description text,        /* product description : can be gain by external apis, or written manually by admin, optional */
                    
                      PRIMARY KEY (id),
                      UNIQUE (symbol, locale, market)
                    );
                    
                    CREATE INDEX idx_platform_market ON product_meta (platform, market);
                EOT
            }
          + kind       = "ConfigMap"
          + metadata   = {
              + name      = "postgresql-init-script"
              + namespace = "postgresql"
            }
        }
      + object   = {
          + apiVersion = "v1"
          + binaryData = (known after apply)
          + data       = {
              + "schema.sql" = <<-EOT
                    CREATE TYPE platform AS ENUM ('POLYGON', 'KIS', 'BUYCYCLE');
                    CREATE TYPE market AS ENUM ('STOCK', 'CRYPTO', 'FOREX', 'OPTION', 'FUTURE');
                    CREATE TYPE locale AS ENUM ('KOR', 'USA');
                    
                    /* metadata table for product data */
                    CREATE TABLE product_meta (
                      id          varchar(32) NOT NULL,  /* an identifier form : {market}.{symbol}.{locale} */
                      symbol      varchar(16)  NOT NULL, /* product symbol */
                      platform    platform    NOT NULL, /* ex) polygon,   */
                      locale      locale      NOT NULL, /* locale of product */
                      market      market      NOT NULL, /* market of product */
                    
                      name        varchar(32), /* human readable stock name, optional */
                      description text,        /* product description : can be gain by external apis, or written manually by admin, optional */
                    
                      PRIMARY KEY (id),
                      UNIQUE (symbol, locale, market)
                    );
                    
                    CREATE INDEX idx_platform_market ON product_meta (platform, market);
                EOT
            }
          + immutable  = (known after apply)
          + kind       = "ConfigMap"
          + metadata   = {
              + annotations                = (known after apply)
              + creationTimestamp          = (known after apply)
              + deletionGracePeriodSeconds = (known after apply)
              + deletionTimestamp          = (known after apply)
              + finalizers                 = (known after apply)
              + generateName               = (known after apply)
              + generation                 = (known after apply)
              + labels                     = (known after apply)
              + managedFields              = (known after apply)
              + name                       = "postgresql-init-script"
              + namespace                  = "postgresql"
              + ownerReferences            = (known after apply)
              + resourceVersion            = (known after apply)
              + selfLink                   = (known after apply)
              + uid                        = (known after apply)
            }
        }
    }

Plan: 3 to add, 1 to change, 0 to destroy.
Releasing state lock. This may take a few moments...

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d projects/dev`
* :put_litter_in_its_place: To **delete** this plan click [here](http://34.64.35.124/lock?id=goboolean%252Finfrastructure%252Fprojects%252Fdev%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d projects/dev`
</details>
Plan: 3 to add, 1 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
